package org.example;

public class Main {
    public static void main(String[] args) {
        Товар[] множествоТоваров = new Товар[3];
        Товар товар1 = new Товар("Беспроводные наушники «SoundMax Pro» с активным шумоподавлением",22022002,
                "SoundMax Pro","Китай",2000,true);

        товар1.вывестиИнформацию();
        System.out.println();

        множествоТоваров[0] = new Товар("Телевизор",220220000,"Пукат","Франция",2000,true);
        множествоТоваров[1] = new Товар("Телефон",21012001,"apple","Америка",80000,false);
        множествоТоваров[2] = new Товар("Гитара",1998,"Струна","Россия",2000,true);

        System.out.println("Каталог товаров:\n");
        for (Товар товар:множествоТоваров){
            товар.вывестиИнформацию();
        }

        Park парк = new Park("Парк для детей", "Краснодар");
        System.out.println("Парк: " + парк.getНазваниеПарка() + "\n");

        Park.Аттракцион крутилка = new Park.Аттракцион("Крутилка","c 8:00 до 20:00", 250);
        Park.Аттракцион поезд = new Park.Аттракцион("Поезд","с 7:00 до 19:00",200);
        Park.Аттракцион колесоОбозрения = new Park.Аттракцион("Колесо обзрения","с 10:00 до 20:00",500);

        System.out.println("Аттракционы:\n");
        крутилка.вывестиИнформацию();
        поезд.вывестиИнформацию();
        колесоОбозрения.вывестиИнформацию();

    }
}